# 6*. Գրել ծրագիր, որը․
#    - կունենա tuple, օրինակ tuple_1 = (4, 5, 5, 2, 3, 2, 3, 4, 5, 5, 3),
#    - կգտնի, թե որ թվից է ամենից շատ հանդիպում tuple_1 ի մեջ
#      և կտպի այդ թիվն ու քանակը, թե քանի անգամ է հանդիպում,
#    - հաշվի առնել որ ամենաշատ հանդիպով սիմվոլներ կարող են մի քանի հատ լինել,
#    տվյալ օրինակի դեպքում պետք է տպի
#    Number is 5, count is 4
#    Քանի որ թվերը հանդիպում են հետևյալ
#    հաճախականությամբ
#    4 - 2
#    5 - 4
#    2 - 2
#    3 - 3


tuple_1 = (4, 5, 5, 2, 3, 2, 3, 4, 5, 5, 3)
num = tuple_1[0]
count = tuple_1.count(num)
for i in tuple_1:
    c = tuple_1.count(i)
    if c > count:
        count = c
        num = i
print(f"number is {num},count is {count}.")

