# . Գրել ծրագիր որը․
#    - կունենա սահմանված list որի մեջ կլինեն միայն int արժեքներ,
#      օրինակ` num_list = [43, 900, 567, 88, 988, 0, 52, 988, 27, 29],
#    - կտպի num_list ի “երկրորդ ամենամեծ” արժեքը,
#      օրինակ` տվյալ դեպքում պետք է տպի 900 , քանի որ ամենամեծ թիվը 988 ն է,
#              իսկ երկրորդ ամենամեծ արժեքը 900:


num_list = [43, 900, 567, 88, 988, 0, 52, 988, 27, 29]
max1 = -1e15 + 1
max2 = -1e15
for i in num_list:
    if max2 < i <max1:
        max2 = i
    elif i > max1:
        max2 = max1
        max1 = i
print(max2)