# Գրել ծրագիր, որը․
#    - երկու չկրկնվող էլեմենտներ պարունակող list-երից կվերցնի բոլոր այն էլեմենտները,
#      որոնք կան և առաջինի մեջ, և երկրորդի ու կվերադարձնի սորտավորված այդ էլեմենտները tuple-ի տեսքով,
#    օրինակ՝ list_1 = [12, 41, 5, 8, 0, 11, -7, 9, -1],
#            list_2 = [36, -12, 0, 18, -1, 12, 45, 21],
#            արդյունքը պետք է լինի՝
#            tuple_1 = (-1, 0, 12)։


list_1 = [12, 41, 5, 8, 0, 11, -7, 9, -1]
list_2 = [36, -12, 0, 18, -1, 12, 45, 21]
lst_result = []
for i in list_1:
    if i in list_2:
        lst_result.append(i)
lst_result.sort()
print(tuple(lst_result))
