# 4․ Գրել ծրագիր, որը․
#    - կկարդա օգտագործողի կողմից մուտքագրված անունը (input-ի միջոցով),
#    - կկարդա օգտագործողի կողմից մուտքագրված ազգանունը (input-ի միջոցով),
#    - կկարդա օգտագործողի կողմից մուտքագրված տարիքը (input-ի միջոցով),
#    - օգտագործելով f-string կտպի հետևյալը․ "Hello {անուն} {ազգանուն}. You are {տարիք} years old.":
#    Հուշում՝ անունը կամ ազգանունը կարող են լինել մեծատառերով կամ փոքրատառերով,
#    դուք տպելուց պետք է այն տպեք առաջին տառը մեծատառ, մյուսները փոքրատառ։

name = input("name = ")
surname = input("surname = ")
age = int(input("age = "))
print(f"Hello {name.capitalize()} {surname.capitalize()}. You are {age} years old.")
